In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

![join](./img/joins.png)

## INNER JOIN

![inner join](./img/inner_join.png)

In [97]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

In [98]:
left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [99]:
right_table = {'ID': [3,4],
              'Country': ['Pandama', 'Spain']}

In [100]:
right_table_df = pd.DataFrame(right_table)
right_table_df

   ID  Country
0   3  Pandama
1   4    Spain

In [101]:
left_table_df.merge(right_table_df, left_on='CountryID', right_on='ID').drop('ID', axis=1)

         Date  CountryID  Units  Country
0  03-01-2020          3     30  Pandama

## SEMI JOIN

In [102]:
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [103]:
right_table_df

   ID  Country
0   3  Pandama
1   4    Spain

- Return the intersection, similar to an inner join
- Return only column from left table and not the rigth
- No duplicated

In [109]:
left_table_df.merge(right_table_df, left_on='CountryID', right_on='ID')[['ID', 'Country']].drop_duplicates(subset='ID')

   ID  Country
0   3  Pandama

## LEFT JOIN

![left join](./img/left_join.png)

In [32]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,4],
              'Units': [40, 25, 30, 35]}

In [33]:
left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          4     35

In [39]:
right_table = {'ID': [1,2, 3],
              'Country': ['USA', 'Canada', 'Panama']}

In [40]:
right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   1     USA
1   2  Canada
2   3  Panama

In [42]:
left_table_df.merge(right_table_df, left_on='CountryID', right_on='ID', how='left').drop('ID', axis=1)

         Date  CountryID  Units Country
0  01-01-2020          1     40     USA
1  02-01-2020          1     25     USA
2  03-01-2020          3     30  Panama
3  04-01-2020          4     35     NaN

## RIGHT JOIN

![right join](./img/right_join.png)

In [43]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,4],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          4     35

In [44]:
right_table = {'ID': [3],
              'Country': ['Pandama']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID  Country
0   3  Pandama

In [45]:
left_table_df.merge(right_table_df, left_on='CountryID', right_on='ID', how='right').drop('ID', axis=1)

         Date  CountryID  Units  Country
0  03-01-2020          3     30  Pandama

## FULL/OUTER JOIN 

![full join](./img/full_outer_join.png)

In [46]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [48]:
right_table = {'ID': [1,2,3,4],
              'Country': ['USA', 'Canada', 'Panama', 'Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   1     USA
1   2  Canada
2   3  Panama
3   4   Spain

In [50]:
left_table_df.merge(right_table_df, left_on='CountryID', right_on='ID', how='outer').drop('ID', axis=1)

         Date  CountryID  Units Country
0  01-01-2020        1.0   40.0     USA
1  02-01-2020        1.0   25.0     USA
2  03-01-2020        3.0   30.0  Panama
3  04-01-2020        2.0   35.0  Canada
4         NaN        NaN    NaN   Spain

## Left Anti Join

![left anti](./img/left_anti_join.png)

In [79]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [80]:
right_table = {'ID': [3,4],
              'Country': ['Panama', 'Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   3  Panama
1   4   Spain

In [81]:
left_join_df = left_table_df.merge(right_table_df,
                                   left_on="CountryID",
                                   right_on='ID',
                                   how='left', indicator=True).drop('ID', axis=1)

In [82]:
left_join_df.loc[left_join_df['_merge'] == 'left_only']

         Date  CountryID  Units Country     _merge
0  01-01-2020          1     40     NaN  left_only
1  02-01-2020          1     25     NaN  left_only
3  04-01-2020          2     35     NaN  left_only

In [64]:
left_only_ids

0    1
1    1
3    2
Name: CountryID, dtype: int64

In [66]:
left_join_df[left_join_df['CountryID'].isin(left_only_ids)]

         Date  CountryID  Units Country     _merge
0  01-01-2020          1     40     NaN  left_only
1  02-01-2020          1     25     NaN  left_only
3  04-01-2020          2     35     NaN  left_only

## Right Anti Join

![right anti join](./img/right_anti_join.png)

In [67]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [68]:
right_table = {'ID': [3,4],
              'Country': ['Panama', 'Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   3  Panama
1   4   Spain

In [70]:
right_join_df = left_table_df.merge(right_table_df,
                                   left_on="CountryID",
                                   right_on='ID',
                                   how='right', indicator=True).drop('ID', axis=1)

In [78]:
right_join_df.loc[right_join_df['_merge'] == 'right_only']

  Date  CountryID  Units Country      _merge
1  NaN        NaN    NaN   Spain  right_only

## Concatenation
- pandas **.concat()** can concatenate both vertically and horizentally
- **axis=0** for vertical

In [92]:
left_join_df

         Date  CountryID  Units Country     _merge
0  01-01-2020          1     40     NaN  left_only
1  02-01-2020          1     25     NaN  left_only
2  03-01-2020          3     30  Panama       both
3  04-01-2020          2     35     NaN  left_only

In [93]:
right_join_df

         Date  CountryID  Units Country      _merge
0  03-01-2020        3.0   30.0  Panama        both
1         NaN        NaN    NaN   Spain  right_only

In [110]:
pd.concat([left_join_df, right_join_df], ignore_index=True, keys=['left_', 'right_'])

         Date  CountryID  Units Country      _merge
0  01-01-2020        1.0   40.0     NaN   left_only
1  02-01-2020        1.0   25.0     NaN   left_only
2  03-01-2020        3.0   30.0  Panama        both
3  04-01-2020        2.0   35.0     NaN   left_only
4  03-01-2020        3.0   30.0  Panama        both
5         NaN        NaN    NaN   Spain  right_only

## Using append method
**.append()**
- Simplified version of **.concat()**
- suppor : **sort_index** and **sort**
- Not support : **keys** and **join** i:e. always **join == outer**